Revit 2027 API
ScheduleVerticalAlignment Enumeration
 Vertical alignment of data in a schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ScheduleVerticalAlignment
Public Enumeration ScheduleVerticalAlignment
public enum class ScheduleVerticalAlignment
type ScheduleVerticalAlignment
Members
Member name | Value | Description
Bottom | 2 |  Bottom aligned
Middle | 1 |  Middle aligned
Top | 0 |  Top aligned
See Also
Reference
Autodesk.Revit.DB Namespace